<template>
    <aside class="menu">
        <p class="menu__title">Сортировка</p>
        <ul class="menu__list">
            <li>
                <div class="menu__list-item">
                    <a>
                        <svg
                            class="s_icon"
                            width="14"
                            height="16"
                            viewBox="0 0 14 16"
                            fill="#3F4651"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M1.68421 9.26316C1.68421 9.99298 1.83158 10.6842 2.12632 11.3368C2.42105 11.9895 2.84211 12.5614 3.38947 13.0526C3.37544 12.9825 3.36842 12.9193 3.36842 12.8632V12.6737C3.36842 12.2246 3.45263 11.8035 3.62105 11.4105C3.78947 11.0175 4.03509 10.6596 4.35789 10.3368L6.73684 8L9.11579 10.3368C9.4386 10.6596 9.68421 11.0175 9.85263 11.4105C10.0211 11.8035 10.1053 12.2246 10.1053 12.6737V12.8632C10.1053 12.9193 10.0982 12.9825 10.0842 13.0526C10.6316 12.5614 11.0526 11.9895 11.3474 11.3368C11.6421 10.6842 11.7895 9.99298 11.7895 9.26316C11.7895 8.5614 11.6596 7.89825 11.4 7.27368C11.1404 6.64912 10.7649 6.09123 10.2737 5.6C9.99298 5.78246 9.69825 5.9193 9.38947 6.01053C9.0807 6.10175 8.76491 6.14737 8.44211 6.14737C7.57193 6.14737 6.81754 5.85965 6.17895 5.28421C5.54035 4.70877 5.17193 4 5.07368 3.15789C4.52632 3.62105 4.04211 4.10175 3.62105 4.6C3.2 5.09825 2.84561 5.60351 2.55789 6.11579C2.27018 6.62807 2.05263 7.15088 1.90526 7.68421C1.75789 8.21754 1.68421 8.74386 1.68421 9.26316ZM6.73684 10.3579L5.53684 11.5368C5.38246 11.6912 5.26316 11.8667 5.17895 12.0632C5.09474 12.2596 5.05263 12.4632 5.05263 12.6737C5.05263 13.1228 5.21754 13.5088 5.54737 13.8316C5.87719 14.1544 6.27368 14.3158 6.73684 14.3158C7.2 14.3158 7.59649 14.1544 7.92632 13.8316C8.25614 13.5088 8.42105 13.1228 8.42105 12.6737C8.42105 12.4491 8.37895 12.2421 8.29474 12.0526C8.21053 11.8632 8.09123 11.6912 7.93684 11.5368L6.73684 10.3579ZM6.73684 0V2.77895C6.73684 3.25614 6.90175 3.65614 7.23158 3.97895C7.5614 4.30175 7.96491 4.46316 8.44211 4.46316C8.69474 4.46316 8.92982 4.41053 9.14737 4.30526C9.36491 4.2 9.55789 4.04211 9.72632 3.83158L10.1053 3.36842C11.1439 3.95789 11.9649 4.77895 12.5684 5.83158C13.1719 6.88421 13.4737 8.02807 13.4737 9.26316C13.4737 11.1439 12.8211 12.7368 11.5158 14.0421C10.2105 15.3474 8.61754 16 6.73684 16C4.85614 16 3.26316 15.3474 1.95789 14.0421C0.652632 12.7368 0 11.1439 0 9.26316C0 7.45263 0.607018 5.73333 1.82105 4.10526C3.03509 2.47719 4.67368 1.10877 6.73684 0Z"></path>
                        </svg>
                        <span>Популярное</span>
                    </a>
                </div>
            </li>
            <li>
                <div class="menu__list-item">
                    <a>
                        <svg
                            class="s_icon"
                            width="16"
                            height="16"
                            viewBox="0 0 16 16"
                            fill="#3F4651"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M10.08 11.2C10.3893 11.5093 10.8907 11.5093 11.2 11.2C11.5093 10.8907 11.5093 10.3893 11.2 10.08L9.56215 8.44215C9.07415 7.95416 8.8 7.29229 8.8 6.60215V4.8C8.8 4.35817 8.44183 4 8 4C7.55817 4 7.2 4.35817 7.2 4.8V7.0547C7.2 7.86486 7.52183 8.64183 8.0947 9.2147L10.08 11.2ZM8 16C6.89333 16 5.85333 15.79 4.88 15.37C3.90667 14.95 3.06 14.38 2.34 13.66C1.62 12.94 1.05 12.0933 0.63 11.12C0.21 10.1467 0 9.10667 0 8C0 6.89333 0.21 5.85333 0.63 4.88C1.05 3.90667 1.62 3.06 2.34 2.34C3.06 1.62 3.90667 1.05 4.88 0.63C5.85333 0.21 6.89333 0 8 0C9.10667 0 10.1467 0.21 11.12 0.63C12.0933 1.05 12.94 1.62 13.66 2.34C14.38 3.06 14.95 3.90667 15.37 4.88C15.79 5.85333 16 6.89333 16 8C16 9.10667 15.79 10.1467 15.37 11.12C14.95 12.0933 14.38 12.94 13.66 13.66C12.94 14.38 12.0933 14.95 11.12 15.37C10.1467 15.79 9.10667 16 8 16ZM8 14.4C9.77333 14.4 11.2833 13.7767 12.53 12.53C13.7767 11.2833 14.4 9.77333 14.4 8C14.4 6.22667 13.7767 4.71667 12.53 3.47C11.2833 2.22333 9.77333 1.6 8 1.6C6.22667 1.6 4.71667 2.22333 3.47 3.47C2.22333 4.71667 1.6 6.22667 1.6 8C1.6 9.77333 2.22333 11.2833 3.47 12.53C4.71667 13.7767 6.22667 14.4 8 14.4Z"></path>
                        </svg>
                        <span>Свежее</span>
                    </a>
                </div>
            </li>
        </ul>
        <p class="menu__title">Категории</p>
        <ul class="menu__list">
            <li class="menu__list-item">
                <a>
                    <svg
                        class="s_icon"
                        width="12"
                        height="16"
                        viewBox="0 0 12 16"
                        fill="#3F4651"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M11.1433 10.3848L0.925514 15.9231C0.50824 16.1498 0 15.8491 0 15.3771V4.30508C0 3.83313 0.508184 3.53472 0.925514 3.7591C1.12597 3.86781 1.25188 4.07833 1.25188 4.30508V10.6878C1.25188 11.1597 1.7624 11.4605 2.17973 11.2315L8.11971 7.98343C8.3062 7.88162 8.53465 7.88162 8.72114 7.98111L11.1409 9.2905C11.5792 9.53111 11.5792 10.1511 11.1433 10.3847L11.1433 10.3848Z"></path>
                        <path
                            d="M10.3578 4.18919C10.7681 4.4298 10.7681 5.01741 10.3578 5.25797L7.21531 7.10407L7.16401 7.13416L3.37811 9.35968C2.96084 9.60492 2.43396 9.30645 2.43396 8.82528V0.621926C2.43396 0.140759 2.96084 -0.157714 3.37811 0.0875349L10.3578 4.18924V4.18919Z"></path>
                    </svg>
                    <span> MPSTATS</span>
                </a>
            </li>
            <li class="menu__list-item">
                <a href="">
                    <svg
                        class="s_icon"
                        width="16"
                        height="15"
                        viewBox="0 0 16 15"
                        fill="#3F4651"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M5.48 11.86L8 10.34L10.52 11.88L9.86 9L12.08 7.08L9.16 6.82L8 4.1L6.84 6.8L3.92 7.06L6.14 9L5.48 11.86ZM3.06 15.2L4.36 9.58L0 5.8L5.76 5.3L8 0L10.24 5.3L16 5.8L11.64 9.58L12.94 15.2L8 12.22L3.06 15.2Z"></path>
                    </svg>
                    <span>Дайджест</span>
                </a>
            </li>
            <li @click="showBuisness" class="menu__list-item">
                <a v-bind:class="{ opened: W_blockHidden }">
                    <svg
                        class="s_icon"
                        width="16"
                        height="16"
                        viewBox="0 0 16 16"
                        fill="#3F4651"
                        xmlns="http://www.w3.org/2000/svg">
                        <mask
                            id="mask0_761_12245"
                            style="mask-type: alpha"
                            maskUnits="userSpaceOnUse"
                            x="0"
                            y="0"
                            width="16"
                            height="16">
                            <rect width="16" height="16" fill="#3F4651"></rect>
                        </mask>
                        <g mask="url(#mask0_761_12245)">
                            <path
                                d="M2.66659 14C2.29992 14 1.98603 13.8694 1.72492 13.6083C1.46381 13.3472 1.33325 13.0333 1.33325 12.6666V5.33331C1.33325 4.96665 1.46381 4.65276 1.72492 4.39165C1.98603 4.13054 2.29992 3.99998 2.66659 3.99998H5.33325V2.66665C5.33325 2.29998 5.46381 1.98609 5.72492 1.72498C5.98603 1.46387 6.29992 1.33331 6.66658 1.33331H9.33325C9.69992 1.33331 10.0138 1.46387 10.2749 1.72498C10.536 1.98609 10.6666 2.29998 10.6666 2.66665V3.99998H13.3333C13.6999 3.99998 14.0138 4.13054 14.2749 4.39165C14.536 4.65276 14.6666 4.96665 14.6666 5.33331V12.6666C14.6666 13.0333 14.536 13.3472 14.2749 13.6083C14.0138 13.8694 13.6999 14 13.3333 14H2.66659ZM6.66658 3.99998H9.33325V2.66665H6.66658V3.99998ZM13.3333 9.99998H9.99992V11.3333H5.99992V9.99998H2.66659V12.6666H13.3333V9.99998ZM7.33325 9.99998H8.66658V8.66665H7.33325V9.99998ZM2.66659 8.66665H5.99992V7.33331H9.99992V8.66665H13.3333V5.33331H2.66659V8.66665Z"></path>
                        </g>
                    </svg>
                    <span>Бизнес</span>
                    <img v-if="W_blockHidden" :src="upImg" alt="" />
                    <img v-else-if="B_blockHidden" :src="downImg" alt="" />
                </a>
                <ul v-bind:class="{ hidden: B_blockHidden }" class="sub-list">
                    <li class="sub-list__item">
                        <a href="">Новичкам</a>
                    </li>
                    <li class="sub-list__item">
                        <a href="">Финансы</a>
                    </li>
                    <li class="sub-list__item">
                        <a href="">Управление</a>
                    </li>
                    <li class="sub-list__item">
                        <a href="">Юридическое руководство</a>
                    </li>
                </ul>
            </li>
            <li @click="showWB" class="menu__list-item">
                <a v-bind:class="{ opened: B_blockHidden }">
                    <svg
                        style="margin-top: 5px"
                        class="s_icon"
                        width="16"
                        height="8"
                        viewBox="0 0 16 8"
                        fill="#3F4651"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            fill-rule="evenodd"
                            clip-rule="evenodd"
                            d="M0 0.10492L1.80024 7.91148L3.20492 7.90823C3.35316 7.45663 3.4374 6.97684 3.56757 6.54549C3.69484 6.12246 3.81343 5.6423 3.9313 5.19576C4.05604 4.72392 4.16994 4.30125 4.29214 3.84062C4.34927 3.62476 4.41725 3.3742 4.4722 3.16304C4.50258 3.04517 4.52499 2.94393 4.56151 2.81775L4.63021 2.57947C4.67432 2.47462 4.63527 2.5473 4.67974 2.49921L6.05622 7.90497L7.46633 7.90931L9.27307 0.0329689L7.74943 0.0351383C7.65037 0.421652 7.56287 0.918805 7.49381 1.32846C7.42005 1.76415 7.32423 2.17741 7.24541 2.62106C7.18865 2.93887 6.80141 5.0891 6.73235 5.19721C6.63075 5.06813 6.57941 4.72247 6.5277 4.54241C6.36898 3.99211 5.285 0.135654 5.21667 0.0289917L4.05062 0.0300764C3.953 0.226768 3.05451 3.43819 2.9182 3.92595C2.86577 4.11324 2.61737 5.10718 2.5183 5.19468L1.51279 0.0315227L0.00470035 0.0333305L0 0.10492Z"></path>
                        <path
                            fill-rule="evenodd"
                            clip-rule="evenodd"
                            d="M11.748 6.46813V4.58727C12.3099 4.57968 13.0215 4.55581 13.5667 4.59414C14.1047 4.63174 14.4793 4.9463 14.4811 5.51035C14.4833 6.08849 14.1459 6.42547 13.5967 6.46416C13.0446 6.50321 12.3132 6.47754 11.748 6.46813ZM11.7603 1.47636C12.3237 1.46804 12.9202 1.45973 13.4821 1.47238C14.0111 1.48431 14.3976 1.75513 14.3737 2.3076C14.3506 2.84272 14.0255 3.12691 13.4818 3.14462C12.9188 3.16306 12.315 3.14969 11.7466 3.14535L11.7603 1.47636ZM15.6486 1.07683C15.5514 0.975953 15.4808 0.815057 15.3695 0.705141C15.2473 0.585463 15.1645 0.514234 15.026 0.42095C14.6489 0.16677 14.2052 0.114704 14.1087 0.0630004C13.792 0.0438374 10.2805 -0.0704173 10.2692 0.0662545C10.2682 0.077463 10.2627 0.0825249 10.2616 0.0875868L10.2526 5.93916C10.2519 6.57733 10.2248 7.27732 10.2559 7.90825C10.5111 7.94224 12.6321 7.91584 13.0808 7.9162C14.0346 7.91693 14.7733 7.87209 15.35 7.35216C16.1913 6.5936 16.3566 4.71743 14.9949 4.05541C14.8543 3.98743 14.5267 3.9191 14.4573 3.88041C14.4909 3.85365 14.4612 3.86667 14.5285 3.84245C14.557 3.83232 14.62 3.81858 14.6398 3.81316C15.6779 3.51776 16.0984 2.53502 15.8005 1.50492C15.756 1.3509 15.6822 1.19832 15.6486 1.07683Z"></path>
                    </svg>
                    <span>Wildberries</span>
                    <img v-if="B_blockHidden" :src="upImg" alt="" />
                    <img v-else-if="W_blockHidden" :src="downImg" alt="" />
                </a>
                <ul v-bind:class="{ hidden: W_blockHidden }" class="sub-list">
                    <li class="sub-list__item">
                        <a href="">Логистика</a>
                    </li>
                    <li class="sub-list__item">
                        <a href="">Карточки товаров</a>
                    </li>
                    <li class="sub-list__item">
                        <a href="">Документы</a>
                    </li>
                    <li class="sub-list__item">
                        <a href="">Продвижение</a>
                    </li>
                    <li class="sub-list__item">
                        <a href="">Финансовый учёт</a>
                    </li>
                    <li class="sub-list__item">
                        <a href="">Поставщикам</a>
                    </li>
                </ul>
            </li>
            <li class="menu__list-item">
                <a>
                    <svg
                        class="s_icon"
                        width="16"
                        height="16"
                        viewBox="0 0 16 16"
                        fill="#3F4651"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            fill-rule="evenodd"
                            clip-rule="evenodd"
                            d="M8.62707 5.43077C9.63642 5.28822 11.0482 5.6169 11.7278 6.0631C12.5899 6.62901 12.9379 7.42504 12.2606 8.5618C11.8293 9.28559 11.091 9.89139 10.2728 10.338C6.87916 12.1902 2.0507 10.8491 3.73368 8.04613C4.42305 6.89803 5.75136 6.13001 7.05625 5.7235C7.74674 5.50839 7.95846 5.52517 8.62707 5.43077ZM2.90227 12.51C3.37005 12.7172 3.40932 12.8918 4.36483 13.2031C6.25766 13.8194 8.08502 13.6579 9.90966 13.0986C11.5464 12.597 13.3829 11.3515 14.2426 9.9053C14.3636 9.70164 14.5366 9.43182 14.6183 9.21687C14.8028 8.59083 14.9683 8.41296 14.9978 7.56386C15.0541 5.93808 14.0446 4.62973 12.6994 3.87483C11.7368 3.33455 10.8176 3.13489 9.54822 3.02222C8.35837 2.91663 7.0857 3.20499 6.06558 3.51466C4.85182 3.88308 3.7285 4.58946 2.88915 5.34879C2.68335 5.53497 2.58283 5.63645 2.38872 5.85529C2.09685 6.18419 1.81438 6.56449 1.56281 7.01623C1.08094 7.88152 0.79746 9.18507 1.17352 10.272C1.33044 10.7255 1.55374 11.2047 1.86843 11.5639C2.49276 12.2764 2.43732 12.0975 2.90227 12.51Z"></path>
                    </svg>
                    <span>Ozon</span>
                </a>
            </li>
        </ul>
        <p class="menu__title">#</p>
        <div class="tags">
            <div v-for="tag in actualTagList" :key="tag">
                <div class="tags__item">{{ tag }}</div>
            </div>
        </div>
        <button @click="showTags" class="read_more-btn">
            {{ actualReadmore }}
        </button>
    </aside>
</template>

<script>
export default {
    data() {
        return {
            downImg: require('@/assets/arrow_down.png'),
            upImg: require('@/assets/arrow_up.png'),
            B_blockHidden: false,
            W_blockHidden: true,
            showMore: false,
            actualTagList: [],
            readMoreBtn: '',
            tags: [
                'bigdata',
                'DBS',
                'FBO',
                'FBS',
                'MPSTATS',
                'SEO',
                'OZON',
                'Wldberries',
                'аналитика',
                'бизнес',
                'видео',
                'документы',
                'займы',
                'заработок',
                'инвестиции',
                'карточки',
                'кейсы',
                'инвестиции',
                'карточки',
                'кейсы',
            ],
        }
    },
    computed: {
        actualTagList() {
            return this.showMore ? this.tags : this.tags.slice(0, 16)
        },
        actualReadmore() {
            return this.showMore
                ? (this.readMoreBtn = 'Свернуть')
                : (this.readMoreBtn = 'Смотреть все')
        },
    },
    methods: {
        showTags() {
            this.showMore = !this.showMore
        },
        showBuisness() {
            this.B_blockHidden = false
            this.W_blockHidden = true
        },
        showWB() {
            this.B_blockHidden = true
            this.W_blockHidden = false
        },
    },
}
</script>

<style scoped lang="scss">
::-webkit-scrollbar {
    width: 3px;
}

.menu::-webkit-scrollbar-thumb {
    background: #38ac5a;
    border-radius: 2px;
}
.menu {
    grid-column: 1;
    height: 85vh;
    position: sticky;
    top: 100px;
    bottom: 0;
    overflow: auto;
    padding-bottom: 60px;
    &__title {
        margin-bottom: 16px;
        font-weight: 700;
        font-size: 20px;
        line-height: 110%;
    }
    &__list {
        list-style-type: none;
        margin-bottom: 40px;
        margin-right: 24px;
        li {
            position: relative;
            display: flex;
            flex-direction: column;
            border-radius: 4px;
            img {
                width: 16px;
            }
            a {
                border-radius: 4px;
                padding: 12px 12px 12px 17px;
                display: flex;
                align-items: center;
                width: 100%;
                &:hover {
                    background-color: rgb(242, 242, 242);
                    svg {
                        fill: #38ac5a; // Your desired fill color
                    }
                }
            }
            svg {
                position: absolute;
                left: 6px;
            }
            span {
                margin-left: 12px;
            }
        }
    }
    .sub-list {
        width: 100%;
        list-style-type: none;
        background: #fff;
        width: 100%;
        &__item {
            display: flex;
            align-items: center;
            width: 100%;
            margin-left: 0;
            font-size: 14px;
            letter-spacing: 0.25px;
            padding-bottom: 0;
            cursor: pointer;
            a {
                font-size: 14px;
                font-weight: 400;
                line-height: 150%;
            }
        }
    }
    &__list-item {
        display: flex;
        column-gap: 10px;
        cursor: pointer;
        a {
            display: flex;
            column-gap: 10px;
        }
        svg {
            margin-top: 1px;
        }
    }
    .tags {
        display: flex;
        flex-wrap: wrap;
        row-gap: 8px;
        column-gap: 8px;
        &__item {
            border-radius: 4px;
            border: 1px solid rgb(242, 242, 242);
            padding: 8px;
            &:hover {
                background-color: rgb(242, 242, 242);
            }
        }
    }
    .read_more-btn {
        cursor: pointer;
        color: #777;
        width: 200px;
        background: #fff;
        color: #3f4651;
        padding: 12px;
        text-align: center;
        border: 1px solid #c4c6ca;
        border-radius: 4px;
        margin-top: 8px;
    }
    .hidden {
        display: none;
    }
    .opened {
        background-color: rgb(242, 242, 242);
        svg {
            fill: #38ac5a; // Your desired fill color
        }
    }
}
</style>
